is1200-example-projects/mcb32tools/headers/proc/p32mz2048ech100.h
#define _DEVCFG1_DMTINTV_POSITION                0x00000003
#define _DEVCFG1_DMTINTV_MASK                    0x00000038
#define _DEVCFG1_DMTINTV_LENGTH                  0x00000003

#define _DEVCFG1_FSOSCEN_POSITION                0x00000006
#define _DEVCFG1_FSOSCEN_MASK                    0x00000040
#define _DEVCFG1_FSOSCEN_LENGTH                  0x00000001

#define _DEVCFG1_IESO_POSITION                   0x00000007
#define _DEVCFG1_IESO_MASK                       0x00000080
#define _DEVCFG1_IESO_LENGTH                     0x00000001

#define _DEVCFG1_POSCMOD_POSITION                0x00000008
#define _DEVCFG1_POSCMOD_MASK                    0x00000300
#define _DEVCFG1_POSCMOD_LENGTH                  0x00000002

#define _DEVCFG1_OSCIOFNC_POSITION               0x0000000A
#define _DEVCFG1_OSCIOFNC_MASK                   0x00000400
#define _DEVCFG1_OSCIOFNC_LENGTH                 0x00000001

#define _DEVCFG1_FCKSM_POSITION                  0x0000000E
#define _DEVCFG1_FCKSM_MASK                      0x0000C000
#define _DEVCFG1_FCKSM_LENGTH                    0x00000002

#define _DEVCFG1_WDTPS_POSITION                  0x00000010
#define _DEVCFG1_WDTPS_MASK                      0x001F0000
#define _DEVCFG1_WDTPS_LENGTH                    0x00000005

#define _DEVCFG1_WDTSPGM_POSITION                0x00000015
#define _DEVCFG1_WDTSPGM_MASK                    0x00200000
#define _DEVCFG1_WDTSPGM_LENGTH                  0x00000001

#define _DEVCFG1_WINDIS_POSITION                 0x00000016
#define _DEVCFG1_WINDIS_MASK                     0x00400000
#define _DEVCFG1_WINDIS_LENGTH                   0x00000001

#define _DEVCFG1_FWDTEN_POSITION                 0x00000017
#define _DEVCFG1_FWDTEN_MASK                     0x00800000
#define _DEVCFG1_FWDTEN_LENGTH                   0x00000001

#define _DEVCFG1_FWDTWINSZ_POSITION              0x00000018
#define _DEVCFG1_FWDTWINSZ_MASK                  0x03000000
#define _DEVCFG1_FWDTWINSZ_LENGTH                0x00000002

#define _DEVCFG1_DMTCNT_POSITION                 0x0000001A
#define _DEVCFG1_DMTCNT_MASK                     0x7C000000
#define _DEVCFG1_DMTCNT_LENGTH                   0x00000005

#define _DEVCFG1_FDMTEN_POSITION                 0x0000001F
#define _DEVCFG1_FDMTEN_MASK                     0x80000000
#define _DEVCFG1_FDMTEN_LENGTH                   0x00000001

#define _DEVCFG1_w_POSITION                      0x00000000
#define _DEVCFG1_w_MASK                          0xFFFFFFFF
#define _DEVCFG1_w_LENGTH                        0x00000020

#define _DEVCFG0_DEBUG_POSITION                  0x00000000
#define _DEVCFG0_DEBUG_MASK                      0x00000003
#define _DEVCFG0_DEBUG_LENGTH                    0x00000002

#define _DEVCFG0_JTAGEN_POSITION                 0x00000002
#define _DEVCFG0_JTAGEN_MASK                     0x00000004
#define _DEVCFG0_JTAGEN_LENGTH                   0x00000001

#define _DEVCFG0_ICESEL_POSITION                 0x00000003
#define _DEVCFG0_ICESEL_MASK                     0x00000018
#define _DEVCFG0_ICESEL_LENGTH                   0x00000002

#define _DEVCFG0_TRCEN_POSITION                  0x00000005
#define _DEVCFG0_TRCEN_MASK                      0x00000020
#define _DEVCFG0_TRCEN_LENGTH                    0x00000001

#define _DEVCFG0_BOOTISA_POSITION                0x00000006
#define _DEVCFG0_BOOTISA_MASK                    0x00000040
#define _DEVCFG0_BOOTISA_LENGTH                  0x00000001

#define _DEVCFG0_FECCCON_POSITION                0x00000008
#define _DEVCFG0_FECCCON_MASK                    0x00000300
#define _DEVCFG0_FECCCON_LENGTH                  0x00000002

#define _DEVCFG0_FSLEEP_POSITION                 0x0000000A
#define _DEVCFG0_FSLEEP_MASK                     0x00000400
#define _DEVCFG0_FSLEEP_LENGTH                   0x00000001

#define _DEVCFG0_DBGPER_POSITION                 0x0000000C
#define _DEVCFG0_DBGPER_MASK                     0x00007000
#define _DEVCFG0_DBGPER_LENGTH                   0x00000003

#define _DEVCFG0_EJTAGBEN_POSITION               0x0000001E
#define _DEVCFG0_EJTAGBEN_MASK                   0x40000000
#define _DEVCFG0_EJTAGBEN_LENGTH                 0x00000001

#define _DEVCFG0_FDEBUG_POSITION                 0x00000000
#define _DEVCFG0_FDEBUG_MASK                     0x00000003
#define _DEVCFG0_FDEBUG_LENGTH                   0x00000002

#define _DEVCFG0_w_POSITION                      0x00000000
#define _DEVCFG0_w_MASK                          0xFFFFFFFF
#define _DEVCFG0_w_LENGTH                        0x00000020

#define _DEVCP0_CP_POSITION                      0x0000001C
#define _DEVCP0_CP_MASK                          0x10000000
#define _DEVCP0_CP_LENGTH                        0x00000001

#define _DEVCP0_w_POSITION                       0x00000000
#define _DEVCP0_w_MASK                           0xFFFFFFFF
#define _DEVCP0_w_LENGTH                         0x00000020

#define _SEQ0_TSEQ_POSITION                      0x00000000
#define _SEQ0_TSEQ_MASK                          0x0000FFFF
#define _SEQ0_TSEQ_LENGTH                        0x00000010

#define _SEQ0_CSEQ_POSITION                      0x00000010
#define _SEQ0_CSEQ_MASK                          0xFFFF0000
#define _SEQ0_CSEQ_LENGTH                        0x00000010

#define _SEQ0_w_POSITION                         0x00000000
#define _SEQ0_w_MASK                             0xFFFFFFFF
#define _SEQ0_w_LENGTH                           0x00000020

#define _DEVADC1_ADCCALDATA_POSITION             0x00000000
#define _DEVADC1_ADCCALDATA_MASK                 0xFFFFFFFF
#define _DEVADC1_ADCCALDATA_LENGTH               0x00000020

#define _DEVADC1_w_POSITION                      0x00000000
#define _DEVADC1_w_MASK                          0xFFFFFFFF
#define _DEVADC1_w_LENGTH                        0x00000020

#define _DEVADC2_ADCCALDATA_POSITION             0x00000000
#define _DEVADC2_ADCCALDATA_MASK                 0xFFFFFFFF
#define _DEVADC2_ADCCALDATA_LENGTH               0x00000020

#define _DEVADC2_w_POSITION                      0x00000000
#define _DEVADC2_w_MASK                          0xFFFFFFFF
#define _DEVADC2_w_LENGTH                        0x00000020

#define _DEVADC3_ADCCALDATA_POSITION             0x00000000
#define _DEVADC3_ADCCALDATA_MASK                 0xFFFFFFFF
#define _DEVADC3_ADCCALDATA_LENGTH               0x00000020

